// lab2_oop.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include "Console.h"
int main()
{
    Console View;
    View.init();
    /*Figure a;
    a.add(10, 0);
    a.add(0, 10);
    a.insert(1, 0, 0);
    a.del(0);
    for (int i = 0; i < a.len(); i++)
        std::cout << a.getPoint(i).X << " " << a.getPoint(i).Y << "\n";
    std::cout << "\n\n\n";
    Point b = a.getPoint(1);
    Point c = a.getCentrMass();
    std::cout << a.getArea() << " " << a.getPerimetr();*/
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
